app/controllers/metrics_controller.rb

SELECT * FROM "metrics"
---
  def index
    @metrics = Metric.all

SELECT * FROM "metrics" WHERE ("metrics"."id" = 980190962)
---
  def show
    @metric = Metric.find(params[:id])

SELECT * FROM "metrics" WHERE ("metrics"."id" = 980190962)
---
  def edit
    @metric = Metric.find(params[:id])

INSERT INTO "metrics" ("name", "created_at", "updated_at", "key") VALUES(NULL, '2010-07-26 18:17:38', '2010-07-26 18:17:38', NULL)
---
  def create
    logger.debug "Creating new metric"
    @metric = Metric.new(params[:metric])

    respond_to do |format|
      if @metric.save

SELECT * FROM "metrics" WHERE ("metrics"."id" = 980190962)
---
  def update
    @metric = Metric.find(params[:id])

SELECT * FROM "metrics" WHERE ("metrics"."id" = 980190962)
DELETE FROM "metrics" WHERE "id" = 980190962
---
  def destroy
    @metric = Metric.find(params[:id])
    @metric.destroy

SELECT * FROM "metrics" WHERE ("metrics"."id" = 2)
SELECT * FROM "data_units" WHERE ("data_units".metric_id = 2)
---
  def graph
    @metric = Metric.find(params[:id])
    g = Gruff::Line.new

    g.theme = {
      :colors => %w(orange purple green red),
      :marker_color => 'blue',
      :background_colors => %w(white white)
    }
    data = []
    labels = {}
    i = 0
    @metric.data_units.each{ |data_unit|