app/controllers/push_controller.rb

SELECT * FROM "metrics" WHERE ("metrics"."id" = 980190962)
INSERT INTO "data_units" ("created_at", "updated_at", "data_point", "metric_id") VALUES('2010-08-31 00:14:39', '2010-08-31 00:14:39', 1.0, 980190962.0)
---
  def data
    @metric = Metric.find(params[:id])
    data_units = @metric.data_units
    to_add = params[:data]

    data_unit = DataUnit.new
    data_unit.data_point = to_add
    data_units.push data_unit